---
kind: type
id: T:Autodesk.Revit.DB.LinearArray
source: html/58e47064-607e-d52b-5930-7e371851a678.htm
---
# Autodesk.Revit.DB.LinearArray

An object that represents an Array created linearly within the Revit project.

## Syntax (C#)
```csharp
public class LinearArray : BaseArray
```